// 189号段是电信号段，178号段是移动号段。

// 国内号码归属运营商情况如下：

// 中国移动：134（不含1349）、135、136、137、138、139、147、150、151、152、157、158、159、182、183、184、187、188

// 中国联通：130、131、132、145（上网卡）、155、156、185、186

// 中国电信：133、1349（卫星通信）、153、180、181、189

// 4G号段：170：[1700(电信)、1705(移动)、1709(联通)]、176(联通)、177(电信)、178(移动)

// 手机号查询绑定qq
// 接口地址：https://zy.xywlapi.cc/qqphone
// 返回格式：json
// 请求方式：get/post
// 请求示例：https://zy.xywlapi.cc/qqphone?phone=18888888888

// qq号查询绑定手机
// 通过QQ号查询密保手机

// 接口地址：https://zy.xywlapi.cc/qqapi
// 返回格式：json
// 请求方式：get/post
// 请求示例：https://zy.xywlapi.cc/qqapi?qq=336699